package BitOperations;

public class Task1 {
    /**
     * Задача 1:
     * Дан большой файл целых чисел. Все числа повторяются два раза, кроме одного
     * числа, которое не повторяется. Найдите это число одним проходом по файлу.
     */
    public static int findNumber(int arr[]) {
        int num = 0;
        // для решения необхоидмо сделать XOR всех элементов, чтобы в итоге получился тот,
        // который не повторяется, потому что те, которые повторяются взаимоууничтожатся
        for (int n : arr)
            num = num ^ n;
        return num;
    }
}
